Revit 2018 API
DrawContext Class
 A class that provides drawing functionality for use by DirectContext3D servers (see Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer).
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public static class DrawContext
Visual Basic
Public NotInheritable Class DrawContext
Visual C++
public ref class DrawContext abstract sealed
Remarks
The drawing facility of this class is conceptually similar to a low-level graphics API, because the functionality operates on a set of geometry primitives such as triangles, lines, and points, which are encoded into a set of vertex and index buffers. Besides submission of geometry in buffers, a major part of the drawing process is responding to certain changes in graphics state. For example, users of this class can implement progressive rendering of geometry by testing whether there have been interruptions that should prevent the drawing from being completed.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.DrawContext
See Also
DrawContext Members
Autodesk.Revit.DB.DirectContext3D Namespace